In [1]:
import pandas as pd

In [3]:
data={
    'name':["mitesh","hiren","harakh","krunal"],
    'age':[18,19,20,21],
    'city':["dholka","surendarangar","muli","ahemdabad"]
}

In [5]:
df=pd.DataFrame(data)

In [7]:
df

     name  age           city
0  mitesh   18         dholka
1   hiren   19  surendarangar
2  harakh   20           muli
3  krunal   21      ahemdabad

In [13]:
df1=df.to_csv('output_file.csv', sep='\t', index=False);

In [15]:
df

     name  age           city
0  mitesh   18         dholka
1   hiren   19  surendarangar
2  harakh   20           muli
3  krunal   21      ahemdabad